MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM395FWAXBG/mcu.h
/* Memory map */
#define FLASH_BASE            (0x00000000UL)
#define RAM_BASE              (0x20000000UL)
#define PERI_BASE             (0x40000000UL)


#define TSB_SSP0_BASE              (PERI_BASE  + 0x0060000UL)
#define TSB_SSP1_BASE              (PERI_BASE  + 0x0061000UL)
#define TSB_SSP2_BASE              (PERI_BASE  + 0x0062000UL)
#define TSB_SSP3_BASE              (PERI_BASE  + 0x0063000UL)
#define TSB_I2C_BASE               (PERI_BASE  + 0x0070000UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00C0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00C0040UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00C0080UL)
#define TSB_PD_BASE                (PERI_BASE  + 0x00C00C0UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x00C0100UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x00C0140UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x00C0180UL)
#define TSB_PH_BASE                (PERI_BASE  + 0x00C01CUL)
#define TSB_PI_BASE                (PERI_BASE  + 0x00C0200UL)
#define TSB_PJ_BASE                (PERI_BASE  + 0x00C0240UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x00C0280UL)
#define TSB_PL_BASE                (PERI_BASE  + 0x00C02C0UL)
#define TSB_PM_BASE                (PERI_BASE  + 0x00C0300UL)
#define TSB_TB0_BASE               (PERI_BASE  + 0x00D0000UL)
#define TSB_TB1_BASE               (PERI_BASE  + 0x00D0040UL)
#define TSB_TB2_BASE               (PERI_BASE  + 0x00D0080UL)
#define TSB_TB3_BASE               (PERI_BASE  + 0x00D00C0UL)
#define TSB_TB4_BASE               (PERI_BASE  + 0x00D0100UL)
#define TSB_TB5_BASE               (PERI_BASE  + 0x00D0140UL)
#define TSB_TB6_BASE               (PERI_BASE  + 0x00D0180UL)
#define TSB_TB7_BASE               (PERI_BASE  + 0x00D01C0UL)
#define TSB_TB8_BASE               (PERI_BASE  + 0x00D0200UL)
#define TSB_PHC_BASE               (PERI_BASE  + 0x00D0240UL)
#define TSB_SBI_BASE               (PERI_BASE  + 0x00E0000UL)
#define TSB_IS2_BASE               (PERI_BASE  + 0x00E1400UL)
#define TSB_SC0_BASE               (PERI_BASE  + 0x00E0080UL)
#define TSB_SC1_BASE               (PERI_BASE  + 0x00E00C0UL)
#define TSB_SC2_BASE               (PERI_BASE  + 0x00E0100UL)
#define TSB_IS10_BASE              (PERI_BASE  + 0x00E1000UL)
#define TSB_IS11_BASE              (PERI_BASE  + 0x00E1100UL)
#define TSB_IS12_BASE              (PERI_BASE  + 0x00E1200UL)
#define TSB_IS13_BASE              (PERI_BASE  + 0x00E1300UL)
#define TSB_AD_BASE                (PERI_BASE  + 0x00F0000UL)
#define TSB_WD_BASE                (PERI_BASE  + 0x00F0080UL)
#define TSB_RTC_BASE               (PERI_BASE  + 0x00F0100UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x00F0200UL)
#define TSB_CEC_BASE               (PERI_BASE  + 0x00F0300UL)
#define TSB_RMC0_BASE              (PERI_BASE  + 0x00F0400UL)
#define TSB_RMC1_BASE              (PERI_BASE  + 0x00F0440UL)
#define TSB_LVD_BASE               (PERI_BASE  + 0x00F0500UL)
#define TSB_OFD_BASE               (PERI_BASE  + 0x00F0600UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1FFF010UL)


/* Peripheral declaration */
#define TSB_SSP0                   ((    TSB_SSP_TypeDef *)  TSB_SSP0_BASE)
#define TSB_SSP1                   ((    TSB_SSP_TypeDef *)  TSB_SSP1_BASE)
#define TSB_SSP2                   ((    TSB_SSP_TypeDef *)  TSB_SSP2_BASE)
#define TSB_SSP3                   ((    TSB_SSP_TypeDef *)  TSB_SSP3_BASE)
#define TSB_I2C                    ((    TSB_I2C_TypeDef *)   TSB_I2C_BASE)
#define TSB_PA                     ((     TSB_PA_TypeDef *)    TSB_PA_BASE)
#define TSB_PB                     ((     TSB_PB_TypeDef *)    TSB_PB_BASE)
#define TSB_PC                     ((     TSB_PC_TypeDef *)    TSB_PC_BASE)
#define TSB_PD                     ((     TSB_PD_TypeDef *)    TSB_PD_BASE)
#define TSB_PE                     ((     TSB_PE_TypeDef *)    TSB_PE_BASE)
#define TSB_PF                     ((     TSB_PF_TypeDef *)    TSB_PF_BASE)
#define TSB_PG                     ((     TSB_PG_TypeDef *)    TSB_PG_BASE)
#define TSB_PH                     ((     TSB_PH_TypeDef *)    TSB_PH_BASE)
#define TSB_PI                     ((     TSB_PI_TypeDef *)    TSB_PI_BASE)
#define TSB_PJ                     ((     TSB_PJ_TypeDef *)    TSB_PJ_BASE)
#define TSB_PK                     ((     TSB_PK_TypeDef *)    TSB_PK_BASE)
#define TSB_PL                     ((     TSB_PL_TypeDef *)    TSB_PL_BASE)
#define TSB_PM                     ((     TSB_PM_TypeDef *)    TSB_PM_BASE)
#define TSB_TB0                    ((     TSB_TB_TypeDef *)   TSB_TB0_BASE)
#define TSB_TB1                    ((     TSB_TB_TypeDef *)   TSB_TB1_BASE)
#define TSB_TB2                    ((     TSB_TB_TypeDef *)   TSB_TB2_BASE)
#define TSB_TB3                    ((     TSB_TB_TypeDef *)   TSB_TB3_BASE)
#define TSB_TB4                    ((     TSB_TB_TypeDef *)   TSB_TB4_BASE)
#define TSB_TB5                    ((     TSB_TB_TypeDef *)   TSB_TB5_BASE)
#define TSB_TB6                    ((     TSB_TB_TypeDef *)   TSB_TB6_BASE)
#define TSB_TB7                    ((     TSB_TB_TypeDef *)   TSB_TB7_BASE)
#define TSB_TB8                    ((     TSB_TB_TypeDef *)   TSB_TB8_BASE)
#define TSB_PHC                    ((    TSB_PHC_TypeDef *)   TSB_PHC_BASE)
#define TSB_SBI                    ((    TSB_SBI_TypeDef *)   TSB_SBI_BASE)
#define TSB_IS2                    ((    TSB_IS2_TypeDef *)   TSB_IS2_BASE)
#define TSB_SC0                    ((     TSB_SC_TypeDef *)   TSB_SC0_BASE)
#define TSB_SC1                    ((     TSB_SC_TypeDef *)   TSB_SC1_BASE)
#define TSB_SC2                    ((     TSB_SC_TypeDef *)   TSB_SC2_BASE)
#define TSB_IS10                   ((    TSB_IS1_TypeDef *)  TSB_IS10_BASE)
#define TSB_IS11                   ((    TSB_IS1_TypeDef *)  TSB_IS11_BASE)
#define TSB_IS12                   ((    TSB_IS1_TypeDef *)  TSB_IS12_BASE)
#define TSB_IS13                   ((    TSB_IS1_TypeDef *)  TSB_IS13_BASE)
#define TSB_AD                     ((     TSB_AD_TypeDef *)    TSB_AD_BASE)
#define TSB_WD                     ((     TSB_WD_TypeDef *)    TSB_WD_BASE)
#define TSB_RTC                    ((    TSB_RTC_TypeDef *)   TSB_RTC_BASE)
#define TSB_CG                     ((     TSB_CG_TypeDef *)    TSB_CG_BASE)
#define TSB_CEC                    ((    TSB_CEC_TypeDef *)   TSB_CEC_BASE)
#define TSB_RMC0                   ((    TSB_RMC_TypeDef *)  TSB_RMC0_BASE)
#define TSB_RMC1                   ((    TSB_RMC_TypeDef *)  TSB_RMC1_BASE)
#define TSB_LVD                    ((    TSB_LVD_TypeDef *)   TSB_LVD_BASE)
#define TSB_OFD                    ((    TSB_OFD_TypeDef *)   TSB_OFD_BASE)
#define TSB_FC                     ((     TSB_FC_TypeDef *)    TSB_FC_BASE)


/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))



/* Synchronous Serial Port */
#define TSB_SSP0_SR_TFE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,0)))
#define TSB_SSP0_SR_TNF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,1)))
#define TSB_SSP0_SR_RNE                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,2)))
#define TSB_SSP0_SR_RFF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,3)))
#define TSB_SSP0_SR_BSY                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->SR,4)))
#define TSB_SSP0_RIS_RORRIS                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,0)))
#define TSB_SSP0_RIS_RTRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,1)))
#define TSB_SSP0_RIS_RXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,2)))
#define TSB_SSP0_RIS_TXRIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->RIS,3)))
#define TSB_SSP0_MIS_RORMIS                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,0)))
#define TSB_SSP0_MIS_RTMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,1)))
#define TSB_SSP0_MIS_RXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,2)))
#define TSB_SSP0_MIS_TXMIS                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_SSP0->MIS,3)))

